config/cf/InformationRegisters/СведенияОДоступностиЗаданийПользователям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СведенияОДоступностиЗаданийПользователям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Доступность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/cf/InformationRegisters/СведенияОДоступностиЗаданийПользователям/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьВсехПользователейПоЗаданию(Знач ЗаданиеСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.СведенияОДоступностиЗаданийПользователям.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Задание.Установить(ЗаданиеСсылка);
	НаборЗаписей.Прочитать();
	
	Результат = Новый Массив;
	
	Для Каждого Запись Из НаборЗаписей Цикл
		
		Результат.Добавить(Запись.Пользователь);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаданиеДоступноПользователю(Пользователь, Задание) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.СведенияОДоступностиЗаданийПользователям.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Задание.Установить(Задание);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		
		Возврат НаборЗаписей[0].Доступность;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции	

#КонецОбласти
